# Напишите программу, которая считывает с клавиатуры два слова (или фразы, неважно),
# после чего вы должны при помощи операции конкатенации сцепить вторую фразу с первой и вывести результат на экран.

# Sample Input:

# Один
# Два
# Sample Output:

# ДваОдин

word_1 = input()
word_2 = input()
print(word_2 + word_1)