# Напишите программу, которая принимает на вход возраст человека (количество полных лет)
# и выводит сколько лет ему исполнится в следующем году
# 🚀Если не справляетесь, здесь подсказка🚀
# Sample Input 1:
# 7
# Sample Output 1:
# 8

age = int(input("Введите Ваш возраст: "))
print(f"В следующем году Вам исполнится {age + 1}")