# Нам осталось поработать с убывающими последовательностями.

# Сформируйте последовательность -11, -12, -13, -14 .... , -35

# Sample Input:

# Sample Output:

# [-11, -12, -13, -14, -15, -16, -17, -18, -19, -20, -21, -22, -23, -24, -25, -26, -27, -28, -29, -30, -31, -32, -33, -34, -35]

print(list(range(-11, -36, -1)))

# Еще одну

# Сформируйте последовательность 10, 9, 8, 7, ... , 0

# Sample Input:

# Sample Output:

# [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0]

print(list(range(10, -1, -1)))

# И последняя последовательность 1000, 950, 900, 850, ... , 500

# Sample Input:

# Sample Output:

# [1000, 950, 900, 850, 800, 750, 700, 650, 600, 550, 500]

print(list(range(1000, 499, -50)))