# Программа получает на вход строку и ваша задача вывести первый элемент данной строки

# Sample Input 1:

# Zemfira
# Sample Output 1:

# Z

text = input()
result = text[0]
print(result)