# Напишите программу, которая принимает на вход два целых числа в отдельных строках и выводит на экран их сумму.

# Sample Input 1:

# 7
# 5
# Sample Output 1:

# 12

a = int(input("Введите первое число: "))

b = int(input("Введите второе число: "))

result = a + b

print(f'Сумма чисел равна: {result}')