# Программа получает на вход строку. Ваша задача развернуть строку и вывести ее на экран.

# Sample Input:

# leetcode.com
# Sample Output:

# moc.edocteel

text = input()
print(text[::-1])