# Программа получает на вход строку и ваша задача вывести последние 4 символа этой строки

# Гарантируется, что вводится будет строка длиной не менее 4 символов

# Sample Input:

# Манчестер сити
# Sample Output:

# сити

text = input()
print(text[-4:])