# Программа получает на вход строку и ваша задача вывести последний символ этой строки

# Sample Input 1:

# Сплин
# Sample Output 1:

# н

text = input()
print(text[-1])