# Найдите результат выражения |a| + |b|

# Значения переменных а и b поступают на вход в отдельных строках и могут быть только целого типа

# Sample Input 1:

# -5
# 9
# Sample Output 1:

# 14

a = int(input())
b = int(input())
res = abs(a) + abs(b)
print(res)