# Напишите функцию exponentiation, которая принимает на вход целое число и выводит на экран через пробел квадрат и куб этого числа. 

# Вам необходимо написать только определение функции exponentiation

def exponentiation(exp):
    exp_1 = exp ** 2
    exp_2 = exp ** 3
    print(exp_1, exp_2)

exponentiation(3)